import csv
students = {
    "Дмитро": {"ВищаМатематика": 5, "Фізика": 4, "дискретнаМатематика": 5, "КомпНауки": 5},
    "Женька": {"Вища Математика": 4, "Фізика": 5, "дискретнаМатематика": 5, "КомпНауки": 4},
    "Потук": {"Вища Математика": 3, "Фізика": 2, "дискретнаМатематика": 3, "КомпНауки": 3},
    "Таня": {"Вища Математика": 3, "Фізика": 3, "дискретнаМатематика": 5, "КомпНауки": 5},
    "Володимир": {"Вища Математика": 3, "Фізика": 3, "дискретнаМатематика": 5, "КомпНауки": 2},
    "Коля": {"Вища Математика": 4, "Фізика": 2, "дискретнаМатематика": 4, "КомпНауки": 4},
    "Маша": {"Вища Математика": 5, "Фізика": 5, "дискретнаМатематика": 4, "КомпНауки": 5},
    "Саня": {"Вища Математика": 3, "Фізика": 2, "дискретнаМатематика": 4, "КомпНауки": 4},
    "Соня": {"Вища Математика": 5, "Фізика": 5, "дискретнаМатематика": 5, "КомпНауки": 5},
    "Артем": {"Вища Математика": 3, "Фізика": 3, "дискретнаМатематика": 3, "КомпНауки": 3},
    "Катя": {"Вища Математика": 2, "Фізика": 2, "дискретнаМатематика": 5, "КомпНауки": 5},
}

with open("students.csv", mode="w", newline="", encoding="utf-8") as file:
    writer = csv.writer(file)
    writer.writerow(["Ім'я", "ВищаМатематика", "Фізика", "дискретнаМатематика", "КомпНауки"])
    for student, grades in students.items():
        writer.writerow([student] + list(grades.values()))

with open("students.csv", mode="r", encoding="utf-8") as file:
    reader = csv.DictReader(file)
    print("Студенти із середнім балом більше 4:")
    for row in reader:
        avg_grade = sum(int(row[subject]) for subject in row if subject != "Ім'я") / 4
        if avg_grade > 4:
            print(f"{row['Ім\'я']}: середній бал {avg_grade:.2f}")
